let N, M; // Повністю змінила код, бо не придумала інакшого способу щоб програма допитувала користувача допоки не введе правильне число
while (true) { // Роблю через вайл, щоб програма повторювала запит поки не отримає правильне число
    N = Number(prompt("Введіть число N:")); // Запитую число і одразу переводжу його у цифри
    if (Number.isInteger(N) && !isNaN(N)) { // Перевіряю число на цільність та додаю умову що не має бути нат-е-намбер
        break; // Перериваю цикл коли обидві умови є виконані
    }
    console.log("Введене значення не є цілим числом. Введіть ціле число.");
}
console.log("Задано число N = " + N);

while (true) { // Тут все так само тільки з другим числом
    M = Number(prompt("Введіть число M:"));
    if (Number.isInteger(M) && !isNaN(M)) {
        break;
    }
    console.log("Введене значення не є цілим числом. Введіть ціле число.");
}
console.log("Задано число M = " + M);

const skipOdd = confirm("Потрібно пропускати парні числа?");
console.log("Пропускати парні числа: " + skipOdd);

let sum = 0;
for (let i = N; i <= M; i++) {
    if (skipOdd && i % 2 === 0) { // Внесла дві перевірки в одну умову
        continue;
    }
    sum += i;
}
console.log("Сума чисел: " + sum);



// Попередній варіант

// let N = Number(prompt("Введіть число N:")); // Користувач вводить потрібне йому число
// console.log("Задано число N = " + N); // Виводимо задане значення 
// if (!Number.isInteger(N) || isNaN(N)) { // Перевіряємо чи число є цілим
//     console.log("Введене значення не є цілим числом. Задача перервана."); // Перервана задача коли число неправильне
// } else {
//     // Код для продовження обчислень коли число було введено правильно, додаємо число М
//     let M = Number(prompt("Введіть число M:")); // Користувач назначає потрібне йому друге число
//     console.log("Задано число M = " + M); // Виводимо задане значення
//     if (!Number.isInteger(M) || isNaN(M)) { // Перевірка числа на придатність
//         console.log("Введене значення не є цілим числом. Задача перервана."); // Перервана задача коли число непридатне
//     } else {
//         // Код для продовження обчислень коли отримали два правильні числа
//         let skipOdd = confirm("Потрібно пропускати парні числа?"); // TRUE – потрібно, FALSE – не потрібно
//         console.log("Пропускати парні числа: " + Boolean(skipOdd)); // Виводимо значення яке було обрано користувачем
//         let sum = 0; // Назначаємо змінну для суми двох чисел
//         for (let i = N; i <= M; i++) { // Встановлюємо поведінку для заданих чисел в циклі: межі обчислення та збільшення числа
//             if (skipOdd) { // Додаємо умову для обчислення суми чисел з урахуванням парних і непарних чисел
//                 if (i % 2 === 0) { // Перевіряється кожне число в циклі чи є воно парним
//                     continue;  // Пропускаємо парні числа
//                 }
//             }
//             sum += i; // Присвоюємо сумі значення отримані з циклу, поки цикл не буде виконано - значення суми поступово збильшуватиметься на кожне наступне число отримане для "i"
//         }
//         console.log("Сума чисел: " + sum); // Виводимо остаточне значення суми всіх чисел з циклу
//     }
// }