let N = Number(prompt("Введіть число N:")); // Користувач вводить потрібне йому число
console.log("Задано число N = " + N); // Виводимо задане значення 
if (!Number.isInteger(N) || isNaN(N)) { // Перевіряємо чи число є цілим
    console.log("Введене значення не є цілим числом. Задача перервана."); // Перервана задача коли число неправильне
} else {
    // Код для продовження обчислень коли число було введено правильно, додаємо число М
    let M = Number(prompt("Введіть число M:")); // Користувач назначає потрібне йому друге число
    console.log("Задано число M = " + M); // Виводимо задане значення
    if (!Number.isInteger(M) || isNaN(M)) { // Перевірка числа на придатність
        console.log("Введене значення не є цілим числом. Задача перервана."); // Перервана задача коли число непридатне
    } else {
        // Код для продовження обчислень коли отримали два правильні числа
        let skipOdd = confirm("Потрібно пропускати парні числа?"); // TRUE – потрібно, FALSE – не потрібно
        console.log("Пропускати парні числа: " + Boolean(skipOdd)); // Виводимо значення яке було обрано користувачем
        let sum = 0; // Назначаємо змінну для суми двох чисел
        for (let i = N; i <= M; i++) { // Встановлюємо поведінку для заданих чисел в циклі: межі обчислення та збільшення числа
            if (skipOdd) { // Додаємо умову для обчислення суми чисел з урахуванням парних і непарних чисел
                if (i % 2 === 0) { // Перевіряється кожне число в циклі чи є воно парним
                    continue;  // Пропускаємо парні числа
                }
            }
            sum += i; // Присвоюємо сумі значення отримані з циклу, поки цикл не буде виконано - значення суми поступово збильшуватиметься на кожне наступне число отримане для "i"
        }
        console.log("Сума чисел: " + sum); // Виводимо остаточне значення суми всіх чисел з циклу
    }
}

// Всі коментарі написала для себе, мені так легше запам'ятовувати і потім орієнтуватись